абатство
абетка
абітурієнт
абрикос
абсолютизм
абсорбент
абстракціонізм
абсурд
авангард
авіакомпанія
авіакомпас
авіалінія
австралія
автобус
автограф
автомобіль
авторитет
агат
агент
агентство
агрегат
агресія
агресор
агроном
агрономія
ад’ютант
адвокат
аденоїд
адміністрація
адмірал
адреса
аеродром
аерозоль
аеропорт
ажіотаж
азарт
азимут
айсберг
академік
академія
академконцерт
акафіст
акваланг
акварель
акваріум
акомпанемент
акорд
акордеон
активіст
актор
акула
акумулятор
акуратно
акустика
акушер
акушерка
акціонер
акція
алігатор
алфавіт
альбом
альпеншток
альпінізм
альпініст
альт
альтернатива
амбіція
амнезія
амплітуда
амплуа
амуніція
амфібія
амфітеатр
амфора
аналіз
аналітик
аналог
анамнез
ананас
анархіст
анатомія
анафора
ангажемент
ангел
андроїд
анекдот
анемія
анестезіолог
анестезія
аніматор
аніме
анкета
анклав
аннотація
анод
анонс
ансамбль
антагонізм
антарктика
антена
антибіотик
антивірус
антиген
антиквар
антисемітизм
антисептик
антициклон
античність
антракт
антураж
апарат
апаратура
апаратурист
апаратчик
апатія
апельсин
аперитив
апетит
аплодисменти
апокаліпсис
апологет
апологія
апостол
апостроф
аптека
арбітр
арбітраж
аргумент
ареал
арена
арешт
аристократ
арія
арка
аркуш
арматура
армія
аромат
ароматизатор
арсенал
артеріографія
артерія
артикул
артикуляція
артист
артистка
археолог
археологія
архів
архіваріус
архіпелаг
архітектор
архітектура
асиметрія
асоціація
аспект
аспірант
астролог
астронавт
астроном
астрономія
асфальт
ательє
атлас
атом
аудит
аудитор
аудиторія
аутсайдер
афера
афіша
баг
багаж
багатство
багнет
бажання
бал
баланс
баласт
балерина
балет
балістика
балка
балкон
бамбук
банан
бандура
банк
банкет
банкір
банкнота
баня
бар
барабан
барабанщик
баракуда
барвінок
барельєф
барикада
бариста
барік
барк
барка
бармалей
бармен
барокамера
бароко
барон
баррикада
бас
басейн
баскетбол
баскетболіст
басова
батальйон
батискаф
батіг
батог
батога
батут
батьківщина
башмак
башта
баян
бедро
безмозок
безпека
безробіття
белетристика
берег
береза
берет
бетон
бетонозмішувач
бетонщик
билина
било
біатлон
біатлоніст
вага
вагон
вагонетка
вагранка
важіль
важливість
вазон
вакансія
вакцина
вал
валеріана
валіза
вальс
валюта
вандал
ванна
вантаж
вантажівка
вареник
варіант
вата
ватажок
ватман
вафля
вахтер
вбрання
вгору
вдова
вегетаріанець
ведмідь
вежа
великдень
велич
величина
вельможа
верба
верблюд
вересень
веретено
верстат
вершина
веселка
весілля
весло
веснянка
ветеран
ветеринар
вечір
вечірка
вибір
вибірка
вибух
вівторок
вівця
газ
газета
газопровід
гай
галактика
галерея
гаманець
ганок
ганчірка
ганьба
гараж
гарантія
гарбуз
гардероб
гармонія
гаряча
гасло
гастроль
герб
героїн
герцог
гетьман
гігант
гідроелектростанція
гіпермаркет
гітара
глагол
глас
глобус
гном
година
гол
голівка
голова
голуб
голубка
голубці
гольф
гора
горб
горець
горизонт
горілка
горлиця
горло
горобець
горшок
госпіталь
готель
грабіжник
град
гранат
граніт
графіка
грець
гривня
гриль
губа
гувернантка
гудзик
гумор
гура
гусак
гуска
далекомір
дама
датчик
дах
дахмат
дача
дачник
дебет
девальвація
девіз
дефіцит
децентралізація
джаз
джерело
джокер
дзвін
дзвінок
дзига
диван
диверсант
диверсія
дивертисмент
дивіденд
дилема
диплом
дипломат
дипломатія
директор
дисертація
диск
дисконт
дискотека
діагноз
добре
довгота
довідка
довіра
договір
доза
дозвіл
долоня
допомога
досвід
дочка
дошка
екран
екскурсія
експеримент
експерт
експертиза
експлікація
експлуатація
експозитура
експозиція
експрес
експресіонізм
експресія
експропріація
екстракт
екстремал
ексцентрик
ексцес
еластичність
електорат
електрик
електрика
електричка
електрод
електродинаміка
електромагніт
електромотор
електрон
електроніка
електростанція
електротехніка
елемент
еліта
елітаризм
емаль
ембарго
емблема
емігрант
еміграція
емісія
емоційність
ендемік
енергія
ентузіазм
енциклопедія
епоха
ескадра
єдність
ємність
жаба
жага
жанр
жарт
жасмин
жебрак
желатин
жемчуг
жердина
жеребець
жерло
жертва
живіт
живопис
живописець
жито
життя
жінка
жовтуха
жовч
жолудь
жонглер
жоржина
жупан
журба
журнал
журналіст
завершення
завіса
завод
загарбник
загарбниця
загин
загородження
заготовка
загривок
загроза
задача
задоволення
задум
заздрість
зазірка
зазіхання
зазубрина
закон
закриття
закуска
зал
залежність
залив
залізо
залізобетон
залізошвейка
заліка
заліт
замах
замерзання
заміжжя
заміс
замісник
замкнення
заможність
замок
замороження
заряд
зеніт
зір
золь-гель
зошит
ідентифікація
ідея
інвестиція
інгредієнт
індекс
інститут
інструкція
інструмент
інсульт
інтеграція
інтелект
інтелігенція
інтенсивність
інтервал
інтерес
інтерфейс
інфекція
інфляція
інформація
інфраструктура
іспит
історія
істота
їдальня
їжа
їжак
кава
кавалерія
кавун
каденція
кадет
кадило
кадр
казан
казарма
казка
казкар
казус
кібернетика
кілобайт
кілобіт
кіловат
кілогерц
кілограм
кілометр
кінестезія
кляуза
кобальт
ковбаса
ковбасар
ковдра
коверт
ковзанка
кража
красуня
крейда
крейсер
крем
крематорій
кремень
креслення
кресло
крига
крижанка
криза
крик
кримінал
криміналіст
криміналістика
крипта
криптограма
криптограф
криптографія
кристал
кристалізація
кристалограф
кристалографія
крісталізм
крісталографія
кров
крокодил
лава
лад
лак
лактоза
ламантин
ламініт
лампа
ланцюг
лапа
латунь
латфак
лауреат
лауреатка
лауреатство
легенда
ледоруб
лекція
лелека
лис
ліс
ложка
локомотив
любов
людина
малюнок
мама
мамонт
мандарин
мандат
мандоліна
мандрівка
мандрівник
манеж
манекен
манжета
манікюр
маніпуляція
маніті
маніфест
маніфестація
манор
мансарда
мануель
мануфактура
марафон
марганець
маржа
маріонетка
маркер
маркетинг
маркіз
маркіровка
маркування
мармур
марс
март
марципан
марш
маршрут
маршрутка
масаж
масажист
масив
маска
масон
масштаб
матеріал
матеріалізм
матерія
мати
мафія
маяк
маятник
мед
медаліст
медаль
медіатор
медовик
медовуха
медуза
межа
мезонін
меланж
меланхолія
меліорація
меліса
мелодія
мелодрама
меломан
мельник
мемуар
менеджер
менеджмент
менестрель
менталітет
меншість
меню
мер
мережа
мереживо
меридіан
меса
метал
металург
металургія
метаморфоза
метан
метастаз
метастаза
метафізика
метафора
метеор
метеорит
метеоролог
метеорологія
метис
метод
методика
методологія
метр
метрика
метро
метроном
метрополітен
метрополія
метушня
меценат
меч
мечеть
мечник
нона
оазис
обсяг
озон
окам'янілість
океанарій
окозамилювач
окружність
октава
олівець
олігарх
олімпіада
омлет
омнібус
омофор
оракул
орангутанг
оранжерея
організм
органологія
орда
ордер
ординатура
орел
орендар
оригінал
оркестр
павич
палець
палиця
паличка
палка
пальто
панянка
паразит
паралакс
парамедик
парасолька
парк
паркан
пародист
пародія
пароль
паронім
партнер
парубок
пасаж
пасажиропотік
п'єса
питання
півень
півострів
підмет
підприємство
підрозділ
підступ
пісок
пісочниця
пістолет
плита
плівка
побрехенька
поверхня
повінь
повість
пов'язка
покоління
покрив
поле
полеміка
поліфонія
полум'я
полуниця
порядок
посилання
потік
потреба
потяг
похідна
пошта
право
правознавство
прагматика
прапор
прапорець
праска
прах
праця
праща
представник
представниця
президія
прейскурант
претензія
префікс
прибор
прибуток
призма
призначення
призьба
прийдешність
приймачка
прийменник
прикмета
прикметник
прилад
приманка
примара
примітив
примітка
примовка
примус
примха
прискорення
прискорювач
проєкт
прокляття
пролог
проміння
пропаганда
пропозиція
простір
протокол
процедура
публікація
пугач
пустеля
пустир
радіомережа
радіоприймач
редактор
редиска
рейдер
рекапіталізація
реклама
релігія
репортаж
репродукція
республіка
рефлекс
речення
речовина
решітка
ринок
рисівництво
рів
ріг
рідина
різниця
різновид
різьба
рік
річка
річниця
робот
робота
роза
розв'язка
розрахунок
розробка
ромашка
рослина
ротор
рушник
сагайдак
сайт
сало
салон
сварка
свердловина
світ
світанок
світлина
світло
секта
секція
селище
село
середина
серпанок
серце
симфонія
система
сіль
сільгосппродукція
сільгосптехніка
склянка
сковорода
скрипка
словник
слово
словосполучення
слон
служба
смаколик
смартфон
смерека
смітник
смуга
сніг
собор
сокира
сонце
сопілка
спадщина
спис
спів
спільник
спільнота
спінет
справа
срібло
станція
стиль
стипендія
стіл
стілець
стіна
стодола
столиця
струм
струмок
субота
суд
судома
сума
сундук
супермаркет
схилення
схід
сходи
сямісен
