#include <iostream>
#include "windows.h"
#include <vector>
using namespace std;

void Color(int color) // малюнки будуть кольоровими
{
	HANDLE hConsole = GetStdHandle(STD_OUTPUT_HANDLE);
	SetConsoleTextAttribute(hConsole, color);
}

void Message(int color, string text)
{
	Color(color);
	cout << text;
	Color(7);
}

class Vocabulary // словник
{
private:
	vector<string> words;
	int size;
	int maxwordlength;

public:
	Vocabulary()
	{
		/*список сл≥в*/
		words = { "абетка", "аб≥тур≥Їнт", "абрикос", "абсолютизм", "абсорбент", "абстракц≥он≥зм", "абсурд", "авангард", "ав≥акомпан≥€", "ав≥акомпас", "ав≥ал≥н≥€", "австрал≥€", "автобус", "автограф", "автомоб≥ль", "авторитет", "авторитет", "авторучка", "автостоп", "автострада", "автотранспорт", "агат", "агат", "агент", "агент", "агентство", "агентство", "агентура", "агенц≥€", "агрегат", "агрес≥€", "агресор", "агроном", "агроном≥€", "адТютант", "адвокат", "аденоњд", "адм≥н≥страц≥€", "адм≥рал", "адреса", "аеродром", "аерозоль", "аеропорт", "аж≥отаж", "азарт", "азимут", "айсберг", "академ≥к", "академ≥€", "академконцерт", "акаф≥ст", "акваланг", "акварель", "аквар≥ум", "акомпанемент", "акорд", "акордеон", "актив≥ст", "актор", "акула", "акумул€тор", "акуратно", "акустика", "акушер", "акушерка", "акц≥онер", "акц≥€", "ал≥гатор", "алфав≥т", "альбом", "альпеншток", "альп≥н≥зм", "альп≥н≥ст", "альт", "альтернатива", "амб≥ц≥€", "амнез≥€", "ампл≥туда", "амплуа", "амун≥ц≥€", "амф≥б≥€", "амф≥театр", "амфора", "анал≥з", "анал≥тик", "аналог", "анамнез", "ананас", "анарх≥ст", "анатом≥€", "анафора", "ангажемент", "ангел", "андроњд", "анекдот", "анем≥€", "анестез≥олог", "анестез≥€", "ан≥матор", "ан≥ме", "анкета", "анклав", "аннотац≥€", "анод", "анонс", "ансамбль", "антагон≥зм", "антарктика", "антена", "антиб≥отик", "антив≥рус", "антиген", "антиквар", "антисем≥тизм", "антисептик", "антициклон", "античн≥сть", "антракт", "антураж", "апарат", "апаратура", "апаратурист", "апаратчик", "апат≥€", "апельсин", "аперитив", "апетит", "аплодисменти", "апокал≥псис", "апологет", "аполог≥€", "апостол", "апостроф", "аптека", "арб≥тр", "арб≥траж", "аргумент", "ареал", "арена", "арешт", "аристократ", "ар≥€", "арка", "аркуш", "арматура", "арм≥€", "аромат", "ароматизатор", "арсенал", "артер≥ограф≥€", "артер≥€", "артикул", "артикул€ц≥€", "артист", "артистка", "археолог", "археолог≥€", "арх≥в", "арх≥вар≥ус", "арх≥пелаг", "арх≥тектор", "арх≥тектура", "асиметр≥€", "асоц≥ац≥€", "аспект", "асп≥рант", "астролог", "астронавт", "астроном", "астроном≥€", "асфальт", "ательЇ", "атлас", "атом", "аудит", "аудитор", "аудитор≥€", "аутсайдер", "афера", "аф≥ша", "баг", "багаж", "багатство", "багнет", "бажанн€", "бал", "баланс", "баласт", "балерина", "балет", "бал≥стика", "балка", "балкон", "бамбук", "банан", "бандура", "банк", "банкет", "банк≥р", "банкнота", "бан€", "бар", "барабан", "барабанщик", "баракуда", "баран", "барв≥нок", "барельЇф", "баржа", "барикада", "бариста", "бармалей", "бармен", "барокамера", "бароко", "барон", "баррикада", "бас", "басейн", "баскетбол", "баскетбол≥ст", "басова", "батальйон", "батискаф", "бат≥г", "батог", "батога", "батут", "батьк≥вщина", "башмак", "башта", "ба€н", "бедро", "безмозок", "безпека", "безроб≥тт€", "белетристика", "берег", "береза", "берет", "бетон", "бетонозм≥шувач", "бетонщик", "билина", "било", "б≥атлон", "б≥атлон≥ст", "блокуванн€", "бр€зкало", "бубон", "вага", "вагон", "вагонетка", "вагранка", "важ≥ль", "важлив≥сть", "вазон", "ваканс≥€", "вакцина", "вал", "валер≥ана", "вал≥за", "вальс", "валюта", "вандал", "ванна", "вантаж", "вантаж≥вка", "вареник", "вар≥ант", "вата", "ватажок", "ватман", "вафл€", "вахтер", "вбранн€", "вгору", "вдова", "вегетар≥анець", "ведм≥дь", "вежа", "великдень", "велич", "величина", "вельможа", "верба", "верблюд", "вересень", "вересень", "веретено", "верстат", "вершина", "веселка", "вес≥лл€", "весло", "весн€нка", "ветеран", "ветеринар", "веч≥р", "веч≥рка", "виб≥р", "виб≥рка", "вибух", "вивченн€", "винах≥дництво", "винищуванн€", "вишн€", "в≥второк", "в≥вц€", "водень", "газ", "газета", "газопров≥д", "гай", "галактика", "галере€", "гаманець", "ганок", "ганч≥рка", "ганьба", "гараж", "гарант≥€", "гарбуз", "гардероб", "гармон≥€", "гар€ча", "гасло", "гастроль", "герб", "героњн", "герцог", "гетьман", "г≥гант", "г≥дроелектростанц≥€", "г≥пермаркет", "г≥тара", "глагол", "глас", "глобус", "гном", "година", "гол", "гол≥вка", "голова", "голуб", "голубка", "голубц≥", "гольф", "гора", "горб", "горець", "горизонт", "гор≥лка", "горлиц€", "горло", "горобець", "горшок", "госп≥таль", "готель", "граб≥жник", "град", "гранат", "гран≥т", "граф≥ка", "грець", "гривн€", "гриль", "губа", "гувернантка", "гудзик", "гумор", "гура", "гусак", "гуска", "далеком≥р", "дама", "датчик", "дах", "дахмат", "дача", "дачник", "дебет", "девальвац≥€", "дев≥з", "деф≥цит", "децентрал≥зац≥€", "джаз", "джерело", "джокер", "дзв≥н", "дзв≥нок", "дзига", "диван", "диверсант", "диверс≥€", "дивертисмент", "див≥денд", "дилема", "диплом", "дипломат", "дипломат≥€", "директор", "дисертац≥€", "диск", "дисконт", "дискотека", "д≥агноз", "добре", "довгота", "дов≥дка", "дов≥ра", "догов≥р", "доза", "дозв≥л", "долон€", "допомога", "досв≥д", "дочка", "дошка", "екран", "екскурс≥€", "експеримент", "експерт", "експертиза", "експл≥кац≥€", "експлуатац≥€", "експозитура", "експозиц≥€", "експрес", "експрес≥он≥зм", "експрес≥€", "експропр≥ац≥€", "екстракт", "екстремал", "ексцентрик", "ексцес", "еластичн≥сть", "електорат", "електрик", "електрика", "електричка", "електрод", "електродинам≥ка", "електромагн≥т", "електромотор", "електрон", "електрон≥ка", "електростанц≥€", "електротехн≥ка", "елемент", "ел≥та", "ел≥таризм", "емаль", "ембарго", "емблема", "ем≥грант", "ем≥грац≥€", "ем≥с≥€", "емоц≥йн≥сть", "ендем≥к", "енерг≥€", "ентуз≥азм", "енциклопед≥€", "епоха", "ескадра", "Їдн≥сть", "Їмн≥сть", "жаба", "жага", "жанр", "жарт", "жасмин", "жебрак", "желатин", "жемчуг", "жердина", "жеребець", "жерло", "жертва", "жив≥т", "живопис", "живописець", "жито", "житт€", "ж≥нка", "жовтуха", "жовч", "жолудь", "жонглер", "жоржина", "жупан", "журба", "журнал", "журнал≥ст", "завершенн€", "зав≥са", "завод", "загарбник", "загарбниц€", "загин", "загородженн€", "заготовка", "загривок", "загроза", "задача", "задоволенн€", "задум", "заздр≥сть", "заз≥рка", "заз≥ханн€", "зазубрина", "закон", "закритт€", "закуска", "зал", "залежн≥сть", "залив", "зал≥зо", "зал≥зобетон", "зал≥зошвейка", "зал≥ка", "зал≥т", "замах", "замерзанн€", "зам≥жж€", "зам≥с", "зам≥сник", "замкненн€", "заможн≥сть", "замок", "замороженн€", "зар€д", "зен≥т", "з≥р", "золь - гель", "зошит", "≥дентиф≥кац≥€", "≥де€", "≥нвестиц≥€", "≥нгред≥Їнт", "≥ндекс", "≥нститут", "≥нструкц≥€", "≥нструмент", "≥нсульт", "≥нтеграц≥€", "≥нтелект", "≥нтел≥генц≥€", "≥нтенсивн≥сть", "≥нтервал", "≥нтерес", "≥нтерфейс", "≥нфекц≥€", "≥нфл€ц≥€", "≥нформац≥€", "≥нфраструктура", "≥спит", "≥стор≥€", "≥стота", "њдальн€", "њжа", "њжак", "кава", "кавалер≥€", "кавун", "каденц≥€", "кадет", "кадило", "кадр", "казан", "казарма", "казка", "казкар", "казус", "карбуванн€", "кв≥тень", "кепкуванн€", "кер≥вництво", "керуванн€", "килимарство", "кип'€тильн€", "кисень", "кис≥ль", "к≥бернетика", "к≥готь", "к≥лобайт", "к≥лоб≥т", "к≥ловат", "к≥логерц", "к≥лограм", "к≥лометр", "к≥нестез≥€", "к≥нь", "кл€уза", "кобальт", "ковальн€", "ковбаса", "ковбасар", "ковдра", "коверт", "ковзанка", "ковтанн€", "козен€", "козен€тко", "коп≥юванн€", "кража", "красун€", "крейда", "крейсер", "крем", "крематор≥й", "кремень", "кресленн€", "кресло", "крига", "крижанка", "криза", "крик", "крим≥нал", "крим≥нал≥ст", "крим≥нал≥стика", "крипта", "криптограма", "криптограф", "криптограф≥€", "кристал", "кристал≥зац≥€", "кристалограф", "кристалограф≥€", "кр≥стал≥зм", "кр≥сталограф≥€", "кров", "крокодил", "лава", "лад", "лазн€", "лак", "лактоза", "ламантин", "лам≥н≥т", "лампа", "ланцюг", "лапа", "латунь", "латфак", "лауреат", "лауреатка", "лауреатство", "леб≥дь", "левиц€", "легенда", "ледоруб", "лекц≥€", "лелека", "ливень", "лизень", "липень", "лис", "л≥с", "ложка", "локомотив", "любов", "людина", "малюнок", "мама", "мамонт", "мандарин", "мандат", "мандол≥на", "мандр≥вка", "мандр≥вник", "манеж", "манекен", "манжета", "ман≥кюр", "ман≥пул€ц≥€", "ман≥т≥", "ман≥фест", "ман≥фестац≥€", "манор", "мансарда", "мануель", "мануфактура", "марафон", "марганець", "маржа", "мар≥онетка", "маркер", "маркетинг", "марк≥з", "марк≥ровка", "маркуванн€", "мармур", "марс", "март", "марципан", "марш", "маршрут", "маршрутка", "масаж", "масажист", "масив", "маска", "масон", "масштаб", "матер≥ал", "матер≥ал≥зм", "матер≥€", "мати", "маф≥€", "ма€к", "ма€тник", "мед", "медал≥ст", "медаль", "мед≥атор", "медовик", "медовуха", "медуза", "межа", "мезон≥н", "меланж", "меланхол≥€", "мел≥орац≥€", "мел≥са", "мелод≥€", "мелодрама", "меломан", "мельник", "мемуар", "менеджер", "менеджмент", "менестрель", "ментал≥тет", "менш≥сть", "меню", "мер", "мережа", "мереживо", "мерид≥ан", "меса", "метал", "металург", "металург≥€", "метаморфоза", "метан", "метастаз", "метастаза", "метаф≥зика", "метафора", "метеор", "метеорит", "метеоролог", "метеоролог≥€", "метис", "метод", "методика", "методолог≥€", "метр", "метрика", "метро", "метроном", "метропол≥тен", "метропол≥€", "метушн€", "меценат", "меч", "мечеть", "мечник", "новор≥чч€", "новос≥лл€", "нона", "оазис", "обс€г", "озброЇнн€", "озон", "окам'€н≥л≥сть", "окантованн€", "океанар≥й", "око", "окозамилюванн€", "окозамилювач", "округленн€", "окружн≥сть", "октава", "олен€", "олен€рство", "ол≥вець", "ол≥гарх", "ол≥йництво", "ол≥мп≥ада", "олово", "омлет", "омн≥бус", "омофор", "оракул", "орангутанг", "оранжере€", "ораторство", "орган≥зм", "органолог≥€", "орда", "ордер", "ординатура", "орел", "орендар", "ориг≥нал", "оркестр", "павич", "палець", "палиц€", "паличка", "палка", "пальто", "пан€нка", "паразит", "паралакс", "парамедик", "парасолька", "парк", "паркан", "пародист", "парод≥€", "пароль", "парон≥м", "партнер", "парубок", "пасаж", "пасажиропот≥к", "передбаченн€", "п'Їса", "питанн€", "п≥вень", "п≥востр≥в", "п≥дмет", "п≥дприЇмство", "п≥дрозд≥л", "п≥дступ", "п≥сок", "п≥сочниц€", "п≥столет", "плита", "пл≥вка", "побрехенька", "поверхн€", "пов≥нь", "пов≥сть", "пов'€зка", "покол≥нн€", "покрив", "поле", "полем≥ка", "пол≥фон≥€", "полум'€", "полуниц€", "пор€док", "посиланн€", "пот≥к", "потреба", "пот€г", "пох≥дна", "пошта", "право", "правознавство", "прагматика", "прапор", "прапорець", "праска", "прах", "прац€", "праща", "представник", "представниц€", "презид≥€", "прейскурант", "претенз≥€", "преф≥кс", "прибор", "прибуток", "призма", "призначенн€", "призьба", "прийдешн≥сть", "приймачка", "прийменник", "прикмета", "прикметник", "прилад", "приманка", "примара", "прим≥тив", "прим≥тка", "примовка", "примус", "примха", "прискоренн€", "прискорювач", "програма", "програм≥ст", "програмуванн€", "проЇкт", "прокл€тт€", "пролог", "пром≥нн€", "пропаганда", "пропозиц≥€", "прост≥р", "протокол", "процедура", "публ≥кац≥€", "пугач", "пустел€", "пустир", "рад≥омережа", "рад≥оприймач", "редактор", "редиска", "рейдер", "рекап≥тал≥зац≥€", "реклама", "рел≥г≥€", "репортаж", "репродукц≥€", "республ≥ка", "рефлекс", "реченн€", "речовина", "реш≥тка", "ринок", "рис≥вництво", "р≥в", "р≥г", "р≥дина", "р≥зниц€", "р≥зновид", "р≥зьба", "р≥к", "р≥чка", "р≥чниц€", "робот", "робота", "роза", "розв'€зка", "розрахунок", "розробка", "ромашка", "рослина", "ротор", "рушник", "сагайдак", "сайт", "сало", "салон", "сварка", "свердловина", "св≥т", "св≥танок", "св≥тлина", "св≥тло", "секта", "секц≥€", "селище", "село", "середина", "серпанок", "серце", "симфон≥€", "система", "с≥ль", "с≥льгосппродукц≥€", "с≥льгосптехн≥ка", "скл€нка", "сковорода", "скрипка", "словник", "слово", "словосполученн€", "слон", "служба", "смаколик", "смартофон", "смартфон", "смерека", "см≥тник", "смуга", "сн≥г", "собор", "сокира", "сонце", "соп≥лка", "спадщина", "спис", "сп≥в", "сп≥льник", "сп≥льнота", "сп≥нет", "справа", "спростуванн€", "ср≥бло", "станц≥€", "стиль", "стипенд≥€", "ст≥л", "ст≥лець", "ст≥на", "стодола", "столиц€", "струм", "струмок", "субота", "суд", "судома", "сума", "сундук", "супермаркет", "схиленн€", "сх≥д", "сходи", "с€м≥сен", "таЇмниц€", "тарашкевиц€", "тар≥лка", "тварина", "твердь", "тв≥р", "театр", "телек≥нез", "телепень", "тема", "темперамент", "темр€ва", "тенета", "теолог≥€", "територ≥€", "терм≥дор", "терм≥н", "термоб≥лизна", "термопаста", "термосумка", "тигр", "тигриц€", "тигриц€", "тиждень", "тиждень", "тональн≥сть", "тополог≥€", "топол€", "топон≥м", "тор", "торба", "трава", "травень", "травма", "травмпункт", "традиц≥€", "трактат", "транзакц≥€", "транзистор", "транзит", "транскодуванн€", "транскрибуванн€", "транспаретн≥сть", "транспорт", "трансферт", "тромбон", "тропа", "троща", "тро€нда", "трубопров≥д", "труд", "тубдиспансер", "туберкульоз", "туман", "тур", "турбаза", "туш", "тюкуванн€", "тютюн", "ув≥чненн€", "ультиматум", "ультразвук", "умова", "унезалежненн€", "ун≥верситет", "упаковуванн€", "уперт≥сть", "уран", "ур€д", "ус≥кновенн€", "усм≥шка", "установа", "уфолог≥€", "ухвала", "учасниц€", "ущ≥льнювач", "у€вленн€", "фабрика", "фабула", "фагот", "фаготист", "файл", "фактор", "фах", "ф≥л≥жанка", "ф≥лолог≥€", "флажолет", "флажолет", "флам≥нго", "флейта", "флейтист", "‘лейчук", "флешбек", "фл≥гель", "форма", "фортеп≥ано", "фортец€", "форум", "фотоапарат", "футбол", "хаз€йство", "халабуда", "халва", "халтура", "харт≥€", "хата", "хвилина", "хвил€", "хв≥ртка", "хв≥ст", "хвороба", "х≥д", "х≥м≥опрепарат", "х≥м≥€", "х≥нд≥", "х≥ротон≥€", "хл≥б", "хл≥бець", "хл≥в", "ходьба", "хокей", "холодець", "храм", "хронолог≥€", "хруск≥т", "хунта", "цв≥ль", "цв≥т", "цв≥тень", "цв≥т≥нн€", "цегельн€", "цегельн€", "цегл€рка", "цегл€рка", "целюлоњд", "цемент", "цем'€нка", "цензура", "церква", "цефењди", "цех", "цив≥л≥зац≥€", "цив≥л≥зован≥сть", "циклон", "циклон", "циклоп", "цил≥ндр", "цил≥ндричн≥сть", "цилюрн€", "цимбали", "цин≥зм", "цитадель", "цитата", "цитолог≥€", "цитрус", "цитруси", "цицька", "ц≥леспр€мован≥сть", "ц≥л≥сн≥сть", "ц≥ль ", "ц≥льн≥сть", "ц≥на", "ц≥нн≥сть", "чагарник", "чай", "чайка", "чайник", "чайонка", "час", "часник", "часом≥р", "часопис", "частина", "частинка", "частка", "частота", "чат", "чача", "чаша", "чвертка", "чверть", "чемодан", "чемп≥он", "чемп≥онат", "чепчик", "череда", "чередник", "черемха", "череп", "черепиц€", "черешн€", "четв≥рка", "шампанське", "шанс", "шапка", "шапл€", "шарф", "шашлик", "швачка", "шве€", "шериф", "шерпа", "шерсть", "шинка", "шинкар", "шинкарка", "ширина", "ширма", "ш≥стка", "шкарпетка", "шкода", "школа", "шлунок", "шлюб", "шоколад", "штрих", "щабель", "щавель", "щедр≥сть", "щенок", "щен€", "щетина", "щиколотка", "щипц≥", "щит", "щитка", "щ≥тка", "щ≥ткар", "щоденник", "щоденниц€", "щука", "щукач", "щур", "юань", "ювел≥р", "ювел≥рка", "юнак", "юнга", "юнга", "юн≥сть", "юриспруденц≥€", "юрист", "юстиф≥кац≥€", "юстиц≥€", "юстиц≥€р", "юстиц≥€рка", "€г≥дка", "€г≥дник", "€гниц€", "€года", "€года", "€дро", "€Їчн€", "€зик", "€зичник", "€йце", "€к≥сть", "€к≥сть", "€ловичина", "€ма", "€мб", "€нтар", "€рмо", "€сла", "€сна", "€сн≥сть" };
			/* роз≥мр словниковоњ бази */
		size = words.size();

		/*найдовше слово*/
		maxwordlength = 0;
		for (int i = 0; i < words.size(); i++)
			if (words[i].length() > maxwordlength) maxwordlength = words[i].length();
	}

	string GetWord(int num)
	{
		if (num >= 0 && num < words.size())
		{
			return words[num];
		}
		else
		{
			return "—лово не знайдено";
		}
	}
	int GetSize()
	{
		return size;
	}
	int GetMaxWordLength()
	{
		return maxwordlength;
	}

	void Show()// тестова функц≥€
	{
		for (int i = 0; i < words.size(); i++)
			cout << words[i] << endl;
	}
};

class WordLength // Ќалаштуванн€ довжини слова
{
protected:
	int length;

public:
	WordLength(int max)
	{
		int temp;
		cout << "¬вед≥ть м≥н≥мальну довжину слова. ћаксимальне значенн€: " << max << endl;
		do
		{
			cin >> temp;
			if (temp > max)  cout << "«наченн€ не може перевищувати максимальне значенн€. —пробуйте ще раз.\n";
		} while (temp > max);
		length = temp;
	}

	int GetLength()
	{
		return length;
	}
};

class AttemptsNumber // налаштуванн€ к≥лькост≥ спроб
{
protected:
	int attempts;

public:
	AttemptsNumber()
	{
		int tempvalue;
		string temp;
		cout << "¬ибер≥ть режим: 1 - 6 спроб, 2 - 8 спроб" << endl;
		do
		{
			cin >> temp;
			if (temp == "1") tempvalue = 6;
			else if (temp == "2") tempvalue = 8;
			else cout << "—пробуйте ще раз. ¬ибер≥ть 1 або 2\n";
		} while (temp != "1" && temp != "2");
		attempts = tempvalue;
	}
	int GetNumber()
	{
		return attempts;
	}
};

class Mode // Ќалаштуванн€ гри
{
private:
	WordLength* wordlength;
	AttemptsNumber* attemptsnumber;

public:
	Mode(WordLength* wordlength, AttemptsNumber* attemptsnumber)
		: wordlength(wordlength), attemptsnumber(attemptsnumber) {}

	int GetLength()
	{
		return wordlength->GetLength();
	}
	int GetNumber()
	{
		return attemptsnumber->GetNumber();
	}
};


class Choice // генерац≥€ випадкових чисел 
{
private:
	int choice;
public:
	Choice(Vocabulary vocabulary) : choice(rand() % vocabulary.GetSize()) {};
	int GetChoice()
	{
		return choice;
	}
};

class Word // слово з≥ словника
{
private:
	string word;
	int length;
public:
	Word(string word) : word(word) {
		length = word.length();
	}
	bool Iflength(int length)
	{
		if (this->length >= length) return true;
		else return false;
	}
	Word(Choice num, int wordlength, Vocabulary vocabulary)
	{
		bool iflength = false;
		int choice = num.GetChoice();
		int temp = choice;
		bool trigger = true;
		do
		{
			Word tempword(vocabulary.GetWord(choice));
			if (tempword.Iflength(wordlength)) { word = tempword.GetWord(); break; }
			else
			{
				if (choice < vocabulary.GetSize() - 1 && trigger) choice++;
				else {
					trigger = false;  temp--; choice = temp;
				};
			}
		} while (true);
		length = word.length();
	};
	string GetWord()
	{
		return word;
	}
	int GetLength()
	{
		return length;
	}
	void Show()
	{
		cout << word << endl;
	}
};

class Letter
{
private:
	char letter;
public:
	void SetLetter()
	{
		char temp;
		Message(11, "¬вед≥ть л≥теру\n");
		cin >> temp;
		letter = temp;
	}

	char GetLetter()
	{
		return letter;
	}
	void Show()
	{
		cout << letter;
	}

};


class Figure
{
private:
	int attempts;
public:
	Figure(int attempts) : attempts(attempts) {};


	void Draw(int attempt)
	{
		switch (attempt)
		{
		case 8:
			Color(12);
			cout << "-----------------\n"
				<< "|         |      \n"
				<< "|         |      \n"
				<< "|         O      \n"
				<< "|         |      \n"
				<< "|        / \\      \n"
				<< "|       /    \\     \n"
				<< "|                 \n";
			Color(7);
			break;
		case 7:
			Color(14);
			cout << "-----------------\n"
				<< "|         |      \n"
				<< "|         |      \n"
				<< "|         O      \n"
				<< "|         |      \n"
				<< "|        / \\      \n"
				<< "|       /         \n"
				<< "|                 \n";
			Color(7);
			break;
		case 6:
			if (attempts == 6) Color(12);
			cout << "-----------------\n"
				<< "|         |      \n"
				<< "|         O      \n"
				<< "|        -|-     \n"
				<< "|        / \\      \n"
				<< "|                 \n";
			Color(7);
			break;
		case 5:
			if (attempts == 6) Color(14);
			cout << "-----------------\n"
				<< "|         |      \n"
				<< "|         O      \n"
				<< "|        -|-     \n"
				<< "|        /      \n"
				<< "|                 \n";
			Color(7);
			break;
		case 4:
			cout << "-----------------\n"
				<< "|         |      \n"
				<< "|         O      \n"
				<< "|        -|-     \n"
				<< "|                \n"
				<< "|                 \n";
			break;
		case 3:
			cout << "-----------------\n"
				<< "|         |      \n"
				<< "|         O      \n"
				<< "|        -|      \n"
				<< "|                \n"
				<< "|                 \n";
			break;
		case 2:
			cout << "-----------------\n"
				<< "|         |      \n"
				<< "|         O      \n"
				<< "|         |      \n"
				<< "|                \n"
				<< "|                 \n";
			break;
		case 1:
			cout << "-----------------\n"
				<< "|         |      \n"
				<< "|         O      \n"
				<< "|                \n"
				<< "|                \n"
				<< "|                 \n";
			break;
		default:
			cout << "-----------------\n"
				<< "|         |      \n"
				<< "|                \n"
				<< "|                \n"
				<< "|                \n"
				<< "|                 \n";
			break;

		}

	}
};

class WordTable
{
private:
	Word* word;
	Figure* figure;
	Letter letter;
	Mode* mode;
	int length; //довжина слова
	bool* ifopen;// перев≥рка чи в≥дкрито л≥теру
	int attempts; // невдал≥ спроби
	char* falseletters = nullptr;
	bool victory;// сигнал до завершенн€ гри (перемога)
	bool failure;// сигнал до завершенн€ гри (поразка)


public:
	WordTable(Word* word, Figure* figure, Mode* mode) : word(word), figure(figure), mode(mode)
	{
		length = word->GetLength();
		ifopen = new bool[length];
		for (int i = 0; i < length; i++)
			ifopen[i] = false; // в≥д початку ус≥ л≥тери закрит≥
		attempts = 0;
		victory = false;
		failure = false;
	}

	WordTable(const WordTable& obj)
	{
		length = obj.length;
		attempts = obj.attempts;
		ifopen = new bool[length];
		for (int i = 0; i < length; i++)
		{
			ifopen[i] = obj.ifopen[i];
		}
		falseletters = new char[attempts];
		for (int i = 0; i < attempts; i++)
		{
			falseletters[i] = obj.falseletters[i];
		}
		word = obj.word;
		figure = obj.figure;
		letter = obj.letter;
		mode = obj.mode;
		victory = obj.victory;
		failure = obj.failure;
	}

	bool IfFinish() // €кщо спроби вичерпано
	{
		if (attempts == mode->GetNumber())
		{
			failure = true;
			return true;
		}
		for (int i = 0; i < length; i++)
		{
			if (ifopen[i] != true) return false;
		}
		victory = true; return true;
	}

	void OpenLetter() // в≥дкриваЇмо л≥тери
	{
		bool success = false;
		letter.SetLetter();
		for (int i = 0; i < length; i++)
			if (word->GetWord()[i] == letter.GetLetter())
			{
				ifopen[i] = true; success = true;
			}
		if (!success) AddFalseLetter(letter);
		Show();

		if (!IfFinish()) OpenLetter(); // €кщо спроби вичерпано
		else if (victory)
		{
			Message(10, "¬и вгадали!\n");

		}
		else if (failure)
		{
			Message(12, "Ќе вгадали!\n");

			word->Show();
		}
	}

	void AddFalseLetter(Letter letter)
	{
		char* temp = new char[attempts + 1];
		for (int i = 0; i < attempts; i++)
		{
			temp[i] = falseletters[i];
		}
		delete[] falseletters;
		temp[attempts] = letter.GetLetter();
		falseletters = temp;
		attempts++;
	}

	void Show()
	{
		system("cls");
		cout << endl;
		Message(11, "—лово: ");
		Color(15);
		for (int i = 0; i < length; i++)
			if (!ifopen[i]) cout << "_ ";
			else cout << word->GetWord()[i] << " ";
		cout << endl;
		Message(11, "ѕомилки: ");
		Color(12);
		for (int i = 0; i < attempts; i++)
		{
			cout << falseletters[i];
			if (i < attempts - 1) cout << ", ";
			else cout << ".\n";
		}
		Color(7);
		cout << endl;
		figure->Draw(attempts);
	}

	bool GetResult()
	{
		if (victory) return true;
		else if (failure) false;
		else cout << "error";
	}

	~WordTable()
	{
		delete[] ifopen;
		delete[] falseletters;
	}

};

class Timer
{
private:
	int start;
	int end;
public:
	Timer() : start(clock()) {}
	void TimeSpent()
	{
		end = clock();
		cout << "\n¬итрачено " << float(end - start) / 1000 << " секунд";
	}
};

class Music
{
private:
	WordTable* wordtable;
public:
	Music(WordTable* wordable) : wordtable(wordtable) {};
	void Play()
	{
		if (wordtable->GetResult())
		{
			Beep(277, 200); Beep(349, 200); Beep(415, 200); Beep(554, 2000); /*подоланн€ глюку*/ Beep(554, 0);
		}
		else
		{
			Beep(392, 200); Beep(392, 200); Beep(392, 200); Beep(311, 2000); /*подоланн€ глюку*/ Beep(311, 0);
		}
	}
};





int main()
{
	setlocale(LC_ALL, "ukr");
	SetConsoleOutputCP(1251);
	SetConsoleCP(1251);
	srand(time(NULL));

	/*—ловник*/
	Vocabulary vocabulary;
	vocabulary.Show(); system("pause"); //“ест: виводимо на екран слово, загадане комп'ютером, п≥д час гри ц€ функц≥€ маЇ бути вимкнена


	/* ¬становлюмо налаштуванн€ */
	WordLength wordlength(vocabulary.GetMaxWordLength());
	AttemptsNumber attemptsnumber;
	Mode gamemode(&wordlength, &attemptsnumber);

	/*  омп'ютер загадуЇ слово */
	Choice choice(vocabulary);
	Word word(choice, gamemode.GetLength(), vocabulary);
	Figure figure(gamemode.GetNumber());
	WordTable wordtable(&word, &figure, &gamemode);

	
		/* √ра */

	wordtable.Show();
	Timer timer;
	wordtable.OpenLetter();
	timer.TimeSpent();
	Music music(&wordtable);
	music.Play();

}
