абатство
абетка
абітурієнт
абрикос
абсолютизм
абсорбент
абстракціонізм
абсурд
авангард
авіакомпанія
авіакомпас
авіалінія
австралія
автобус
автограф
автомобіль
авторитет
авторитет
авторучка
автостоп
автострада
автотранспорт
агат
агат
агент
агент
агентство
агентство
агентура
агенція
агрегат
агресія
агресор
агроном
агрономія
ад’ютант
адвокат
аденоїд
адміністрація
адмірал
адреса
аеродром
аерозоль
аеропорт
ажіотаж
азарт
азимут
айсберг
академік
академія
академконцерт
акафіст
акваланг
акварель
акваріум
акомпанемент
акорд
акордеон
активіст
актор
акула
акумулятор
акуратно
акустика
акушер
акушерка
акціонер
акція
алігатор
алфавіт
альбом
альпеншток
альпінізм
альпініст
альт
альтернатива
амбіція
амнезія
амплітуда
амплуа
амуніція
амфібія
амфітеатр
амфора
аналіз
аналітик
аналог
анамнез
ананас
анархіст
анатомія
анафора
ангажемент
ангел
андроїд
анекдот
анемія
анестезіолог
анестезія
аніматор
аніме
анкета
анклав
аннотація
анод
анонс
ансамбль
антагонізм
антарктика
антена
антибіотик
антивірус
антиген
антиквар
антисемітизм
антисептик
антициклон
античність
антракт
антураж
апарат
апаратура
апаратурист
апаратчик
апатія
апельсин
аперитив
апетит
аплодисменти
апокаліпсис
апологет
апологія
апостол
апостроф
аптека
арбітр
арбітраж
аргумент
ареал
арена
арешт
аристократ
арія
арка
аркуш
арматура
армія
аромат
ароматизатор
арсенал
артеріографія
артерія
артикул
артикуляція
артист
артистка
археолог
археологія
архів
архіваріус
архіпелаг
архітектор
архітектура
асиметрія
асоціація
аспект
аспірант
астролог
астронавт
астроном
астрономія
асфальт
ательє
атлас
атом
аудит
аудитор
аудиторія
аутсайдер
афера
афіша
баг
багаж
багатство
багнет
бажання
бал
баланс
баласт
балерина
балет
балістика
балка
балкон
бамбук
банан
бандура
банк
банкет
банкір
банкнота
баня
бар
барабан
барабанщик
баракуда
баран
барвінок
барельєф
баржа
барикада
бариста
бармалей
бармен
барокамера
бароко
барон
баррикада
бас
басейн
баскетбол
баскетболіст
басова
батальйон
батискаф
батіг
батог
батога
батут
батьківщина
башмак
башта
баян
бедро
безмозок
безпека
безробіття
белетристика
берег
береза
берет
бетон
бетонозмішувач
бетонщик
билина
било
біатлон
біатлоніст
блокування
брязкало
бубон
вага
вагон
вагонетка
вагранка
важіль
важливість
вазон
вакансія
вакцина
вал
валеріана
валіза
вальс
валюта
вандал
ванна
вантаж
вантажівка
вареник
варіант
вата
ватажок
ватман
вафля
вахтер
вбрання
вгору
вдова
вегетаріанець
ведмідь
вежа
великдень
велич
величина
вельможа
верба
верблюд
вересень
вересень
веретено
верстат
вершина
веселка
весілля
весло
веснянка
ветеран
ветеринар
вечір
вечірка
вибір
вибірка
вибух
вивчення
винахідництво
винищування
вишня
вівторок
вівця
водень
газ
газета
газопровід
гай
галактика
галерея
гаманець
ганок
ганчірка
ганьба
гараж
гарантія
гарбуз
гардероб
гармонія
гаряча
гасло
гастроль
герб
героїн
герцог
гетьман
гігант
гідроелектростанція
гіпермаркет
гітара
глагол
глас
глобус
гном
година
гол
голівка
голова
голуб
голубка
голубці
гольф
гора
горб
горець
горизонт
горілка
горлиця
горло
горобець
горшок
госпіталь
готель
грабіжник
град
гранат
граніт
графіка
грець
гривня
гриль
губа
гувернантка
гудзик
гумор
гура
гусак
гуска
далекомір
дама
датчик
дах
дахмат
дача
дачник
дебет
девальвація
девіз
дефіцит
децентралізація
джаз
джерело
джокер
дзвін
дзвінок
дзига
диван
диверсант
диверсія
дивертисмент
дивіденд
дилема
диплом
дипломат
дипломатія
директор
дисертація
диск
дисконт
дискотека
діагноз
добре
довгота
довідка
довіра
договір
доза
дозвіл
долоня
допомога
досвід
дочка
дошка
екран
екскурсія
експеримент
експерт
експертиза
експлікація
експлуатація
експозитура
експозиція
експрес
експресіонізм
експресія
експропріація
екстракт
екстремал
ексцентрик
ексцес
еластичність
електорат
електрик
електрика
електричка
електрод
електродинаміка
електромагніт
електромотор
електрон
електроніка
електростанція
електротехніка
елемент
еліта
елітаризм
емаль
ембарго
емблема
емігрант
еміграція
емісія
емоційність
ендемік
енергія
ентузіазм
енциклопедія
епоха
ескадра
єдність
ємність
жаба
жага
жанр
жарт
жасмин
жебрак
желатин
жемчуг
жердина
жеребець
жерло
жертва
живіт
живопис
живописець
жито
життя
жінка
жовтуха
жовч
жолудь
жонглер
жоржина
жупан
журба
журнал
журналіст
завершення
завіса
завод
загарбник
загарбниця
загин
загородження
заготовка
загривок
загроза
задача
задоволення
задум
заздрість
зазірка
зазіхання
зазубрина
закон
закриття
закуска
зал
залежність
залив
залізо
залізобетон
залізошвейка
заліка
заліт
замах
замерзання
заміжжя
заміс
замісник
замкнення
заможність
замок
замороження
заряд
зеніт
зір
золь-гель
зошит
ідентифікація
ідея
інвестиція
інгредієнт
індекс
інститут
інструкція
інструмент
інсульт
інтеграція
інтелект
інтелігенція
інтенсивність
інтервал
інтерес
інтерфейс
інфекція
інфляція
інформація
інфраструктура
іспит
історія
істота
їдальня
їжа
їжак
кава
кавалерія
кавун
каденція
кадет
кадило
кадр
казан
казарма
казка
казкар
казус
карбування
квітень
кепкування
керівництво
керування
килимарство
кип'ятильня
кисень
кисіль
кібернетика
кіготь
кілобайт
кілобіт
кіловат
кілогерц
кілограм
кілометр
кінестезія
кінь
кляуза
кобальт
ковальня
ковбаса
ковбасар
ковдра
коверт
ковзанка
ковтання
козеня
козенятко
копіювання
кража
красуня
крейда
крейсер
крем
крематорій
кремень
креслення
кресло
крига
крижанка
криза
крик
кримінал
криміналіст
криміналістика
крипта
криптограма
криптограф
криптографія
кристал
кристалізація
кристалограф
кристалографія
крісталізм
крісталографія
кров
крокодил
лава
лад
лазня
лак
лактоза
ламантин
ламініт
лампа
ланцюг
лапа
латунь
латфак
лауреат
лауреатка
лауреатство
лебідь
левиця
легенда
ледоруб
лекція
лелека
ливень
лизень
липень
лис
ліс
ложка
локомотив
любов
людина
малюнок
мама
мамонт
мандарин
мандат
мандоліна
мандрівка
мандрівник
манеж
манекен
манжета
манікюр
маніпуляція
маніті
маніфест
маніфестація
манор
мансарда
мануель
мануфактура
марафон
марганець
маржа
маріонетка
маркер
маркетинг
маркіз
маркіровка
маркування
мармур
марс
март
марципан
марш
маршрут
маршрутка
масаж
масажист
масив
маска
масон
масштаб
матеріал
матеріалізм
матерія
мати
мафія
маяк
маятник
мед
медаліст
медаль
медіатор
медовик
медовуха
медуза
межа
мезонін
меланж
меланхолія
меліорація
меліса
мелодія
мелодрама
меломан
мельник
мемуар
менеджер
менеджмент
менестрель
менталітет
меншість
меню
мер
мережа
мереживо
меридіан
меса
метал
металург
металургія
метаморфоза
метан
метастаз
метастаза
метафізика
метафора
метеор
метеорит
метеоролог
метеорологія
метис
метод
методика
методологія
метр
метрика
метро
метроном
метрополітен
метрополія
метушня
меценат
меч
мечеть
мечник
новоріччя
новосілля
нона
оазис
обсяг
озброєння
озон
окам'янілість
окантовання
океанарій
око
окозамилювання
окозамилювач
округлення
окружність
октава
оленя
оленярство
олівець
олігарх
олійництво
олімпіада
олово
омлет
омнібус
омофор
оракул
орангутанг
оранжерея
ораторство
організм
органологія
орда
ордер
ординатура
орел
орендар
оригінал
оркестр
павич
палець
палиця
паличка
палка
пальто
панянка
паразит
паралакс
парамедик
парасолька
парк
паркан
пародист
пародія
пароль
паронім
партнер
парубок
пасаж
пасажиропотік
передбачення
п'єса
питання
півень
півострів
підмет
підприємство
підрозділ
підступ
пісок
пісочниця
пістолет
плита
плівка
побрехенька
поверхня
повінь
повість
пов'язка
покоління
покрив
поле
полеміка
поліфонія
полум'я
полуниця
порядок
посилання
потік
потреба
потяг
похідна
пошта
право
правознавство
прагматика
прапор
прапорець
праска
прах
праця
праща
представник
представниця
президія
прейскурант
претензія
префікс
прибор
прибуток
призма
призначення
призьба
прийдешність
приймачка
прийменник
прикмета
прикметник
прилад
приманка
примара
примітив
примітка
примовка
примус
примха
прискорення
прискорювач
програма
програміст
програмування
проєкт
прокляття
пролог
проміння
пропаганда
пропозиція
простір
протокол
процедура
публікація
пугач
пустеля
пустир
радіомережа
радіоприймач
редактор
редиска
рейдер
рекапіталізація
реклама
релігія
репортаж
репродукція
республіка
рефлекс
речення
речовина
решітка
ринок
рисівництво
рів
ріг
рідина
різниця
різновид
різьба
рік
річка
річниця
робот
робота
роза
розв'язка
розрахунок
розробка
ромашка
рослина
ротор
рушник
сагайдак
сайт
сало
салон
сварка
свердловина
світ
світанок
світлина
світло
секта
секція
селище
село
середина
серпанок
серце
симфонія
система
сіль
сільгосппродукція
сільгосптехніка
склянка
сковорода
скрипка
словник
слово
словосполучення
слон
служба
смаколик
смартофон
смартфон
смерека
смітник
смуга
сніг
собор
сокира
сонце
сопілка
спадщина
спис
спів
спільник
спільнота
спінет
справа
спростування
срібло
станція
стиль
стипендія
стіл
стілець
стіна
стодола
столиця
струм
струмок
субота
суд
судома
сума
сундук
супермаркет
схилення
схід
сходи
сямісен
таємниця
тарашкевиця
тарілка
тварина
твердь
твір
театр
телекінез
телепень
тема
темперамент
темрява
тенета
теологія
територія
термідор
термін
термобілизна
термопаста
термосумка
тигр
тигриця
тигриця
тиждень
тиждень
тональність
топологія
тополя
топонім
тор
торба
трава
травень
травма
травмпункт
традиція
трактат
транзакція
транзистор
транзит
транскодування
транскрибування
транспаретність
транспорт
трансферт
тромбон
тропа
троща
троянда
трубопровід
труд
тубдиспансер
туберкульоз
туман
тур
турбаза
туш
тюкування
тютюн
увічнення
ультиматум
ультразвук
умова
унезалежнення
університет
упаковування
упертість
уран
уряд
усікновення
усмішка
установа
уфологія
ухвала
учасниця
ущільнювач
уявлення
фабрика
фабула
фагот
фаготист
файл
фактор
фах
філіжанка
філологія
флажолет
флажолет
фламінго
флейта
флейтист
Флейчук
флешбек
флігель
форма
фортепіано
фортеця
форум
фотоапарат
футбол
хазяйство
халабуда
халва
халтура
хартія
хата
хвилина
хвиля
хвіртка
хвіст
хвороба
хід
хіміопрепарат
хімія
хінді
хіротонія
хліб
хлібець
хлів
ходьба
хокей
холодець
храм
хронологія
хрускіт
хунта
цвіль
цвіт
цвітень
цвітіння
цегельня
цегельня
цеглярка
цеглярка
целюлоїд
цемент
цем'янка
цензура
церква
цефеїди
цех
цивілізація
цивілізованість
циклон
циклон
циклоп
циліндр
циліндричність
цилюрня
цимбали
цинізм
цитадель
цитата
цитологія
цитрус
цитруси
цицька
цілеспрямованість
цілісність
ціль 
цільність
ціна
цінність
чагарник
чай
чайка
чайник
чайонка
час
часник
часомір
часопис
частина
частинка
частка
частота
чат
чача
чаша
чвертка
чверть
чемодан
чемпіон
чемпіонат
чепчик
череда
чередник
черемха
череп
черепиця
черешня
четвірка
шампанське
шанс
шапка
шапля
шарф
шашлик
швачка
швея
шериф
шерпа
шерсть
шинка
шинкар
шинкарка
ширина
ширма
шістка
шкарпетка
шкода
школа
шлунок
шлюб
шоколад
штрих
щабель
щавель
щедрість
щенок
щеня
щетина
щиколотка
щипці
щит
щитка
щітка
щіткар
щоденник
щоденниця
щука
щукач
щур
юань
ювелір
ювелірка
юнак
юнга
юнга
юність
юриспруденція
юрист
юстифікація
юстиція
юстиціяр
юстиціярка
ягідка
ягідник
ягниця
ягода
ягода
ядро
яєчня
язик
язичник
яйце
якість
яловичина
яма
ямб
янтар
ярмо
ясла
ясна
ясність
